
# Даны 2 числа. Показать большее и меньшее.


# a = int(input('введите a'))
# b = int(input('введите b'))
# if a > b:
#     print('Больше', a)
# else:
#     print('Больше', b)


# password = 'qwe'
# admin_pass = 'admin'
#
# if input('Введите пароль: ') == password:
#     print('Авторизован успешно!')
#     if input('Введите пароль админа: ') == admin_pass:
#         print('Rooted!')
#     else:
#         print('Not Rooted!')
# else:
#   print('не авторизован успешно!')











color = 'red' #'qweqwe'

# if color == 'red':
#     print('красный')
# elif color == 'green':
#     print('зеленый')
# elif color == 'black':
#     print('черный')
#
# elif color == 'white':
#     print('белый')
# else:
#     print('unk')
